sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lcd.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_lcd__include
#define ti_devices_msp_peripherals_hw_lcd__include

/* This preliminary header file does not have a version number */
/* MMR repo: https://bitbucket.itg.ti.com/projects/cmcu_msp65ip/repos/f65msplcd */
/* MMR revision: f30da4e0c2d59567e167092fa6005fd6fe36bbf6 */
/* Generator revision: c98c4ac511e2bd0d918c5d427bd46b7a359dacf1
   (MInT: ec7ec7482a60c6871be32db8b378ec27aa4771f6) */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* LCD Registers
******************************************************************************/
#define LCD_INT_EVENT0_OFS                       ((uint32_t)0x00001020U)


/** @addtogroup LCD_INT_EVENT0
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} LCD_INT_EVENT0_Regs;

/*@}*/ /* end of group LCD_INT_EVENT0 */

/** @addtogroup LCD
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED1[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
       uint32_t RESERVED2[514];
  LCD_INT_EVENT0_Regs  INT_EVENT0;                        /* !< (@ 0x00001020) */
       uint32_t RESERVED3[37];
  __IO uint32_t EVT_MODE;                          /* !< (@ 0x000010E0) Event Mode */
       uint32_t RESERVED4[7];
  __IO uint32_t LCDCTL0;                           /* !< (@ 0x00001100) LCD control register 0 */
       uint32_t RESERVED5;
  __IO uint32_t LCDBLKCTL;                         /* !< (@ 0x00001108) LCD blicking control register */
  __IO uint32_t LCDMEMCTL;                         /* !< (@ 0x0000110C) LCD memory control LCD memory control register */
  __IO uint32_t LCDVCTL;                           /* !< (@ 0x00001110) LCD voltage control register */
  __IO uint32_t LCDPCTL0;                          /* !< (@ 0x00001114) LCD port control register 0 */
  __IO uint32_t LCDPCTL1;                          /* !< (@ 0x00001118) LCD port control register 1 */
  __IO uint32_t LCDPCTL2;                          /* !< (@ 0x0000111C) LCD port control register 2 */
  __IO uint32_t LCDPCTL3;                          /* !< (@ 0x00001120) LCD port control  register 3 */
       uint32_t RESERVED6;
  __IO uint32_t LCDCSSEL0;                         /* !< (@ 0x00001128) LCD common segment select register 0 */
  __IO uint32_t LCDCSSEL1;                         /* !< (@ 0x0000112C) LCD common segment select register 1 */
  __IO uint32_t LCDCSSEL2;                         /* !< (@ 0x00001130) LCD common segment select register 2 */
  __IO uint32_t LCDCSSEL3;                         /* !< (@ 0x00001134) LCD common segment select register 3 */
       uint32_t RESERVED7[2];
  __IO uint8_t LCDM[64];                          /* !< (@ 0x00001140) LCD memory index register */
  __IO uint8_t LCDBM[32];                         /* !< (@ 0x00001180) LCD blinking memory index register */
       uint32_t RESERVED8[791];
  __IO uint32_t LCDVREFCFG;                        /* !< (@ 0x00001DFC) LCD VREF config register */
} LCD_Regs;

