sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lcd.h
/*@}*/ /* end of group LCD */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* LCD Register Control Bits
******************************************************************************/

/* LCD_IIDX Bits */
/* LCD_IIDX[STAT] Bits */
#define LCD_IIDX_STAT_OFS                        (0)                             /* !< STAT Offset */
#define LCD_IIDX_STAT_MASK                       ((uint32_t)0x000000FFU)         /* !< LCD Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MISC. 15h-1Fh =
                                                                                    Reserved */
#define LCD_IIDX_STAT_NO_INTR                    ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define LCD_IIDX_STAT_FRAME_START                ((uint32_t)0x00000001U)         /* !< Start of new frame interrupt */
#define LCD_IIDX_STAT_BLK_OFF                    ((uint32_t)0x00000002U)         /* !< Blinking segments off interrupt */
#define LCD_IIDX_STAT_BLK_ON                     ((uint32_t)0x00000003U)         /* !< Blinking segments on interrupt */

/* LCD_IMASK Bits */
/* LCD_IMASK[FRMSTART] Bits */
#define LCD_IMASK_FRMSTART_OFS                   (0)                             /* !< FRMSTART Offset */
#define LCD_IMASK_FRMSTART_MASK                  ((uint32_t)0x00000001U)         /* !< Start of new LCD frame. */
#define LCD_IMASK_FRMSTART_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LCD_IMASK_FRMSTART_SET                   ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* LCD_IMASK[BLKOFF] Bits */
#define LCD_IMASK_BLKOFF_OFS                     (1)                             /* !< BLKOFF Offset */
#define LCD_IMASK_BLKOFF_MASK                    ((uint32_t)0x00000002U)         /* !< Blinking segments off. */
#define LCD_IMASK_BLKOFF_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LCD_IMASK_BLKOFF_SET                     ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* LCD_IMASK[BLKON] Bits */
#define LCD_IMASK_BLKON_OFS                      (2)                             /* !< BLKON Offset */
#define LCD_IMASK_BLKON_MASK                     ((uint32_t)0x00000004U)         /* !< Blinkking segments on. */
#define LCD_IMASK_BLKON_CLR                      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define LCD_IMASK_BLKON_SET                      ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */

/* LCD_RIS Bits */
/* LCD_RIS[FRMSTART] Bits */
#define LCD_RIS_FRMSTART_OFS                     (0)                             /* !< FRMSTART Offset */
#define LCD_RIS_FRMSTART_MASK                    ((uint32_t)0x00000001U)         /* !< Set in start of a new frame. */
#define LCD_RIS_FRMSTART_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt flag cleared */
#define LCD_RIS_FRMSTART_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt flag set */
/* LCD_RIS[BLKOFF] Bits */
#define LCD_RIS_BLKOFF_OFS                       (1)                             /* !< BLKOFF Offset */
#define LCD_RIS_BLKOFF_MASK                      ((uint32_t)0x00000002U)         /* !< Blinking segments turned off
                                                                                    interrupt flag. */
#define LCD_RIS_BLKOFF_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt flag cleared */
#define LCD_RIS_BLKOFF_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt flag set */
/* LCD_RIS[BLKON] Bits */
#define LCD_RIS_BLKON_OFS                        (2)                             /* !< BLKON Offset */
#define LCD_RIS_BLKON_MASK                       ((uint32_t)0x00000004U)         /* !< Blinking segments turned on. */
#define LCD_RIS_BLKON_CLR                        ((uint32_t)0x00000000U)         /* !< Interrupt flag cleared */
#define LCD_RIS_BLKON_SET                        ((uint32_t)0x00000004U)         /* !< Interrupt flag set */

/* LCD_MIS Bits */
/* LCD_MIS[FRMSTART] Bits */
#define LCD_MIS_FRMSTART_OFS                     (0)                             /* !< FRMSTART Offset */
#define LCD_MIS_FRMSTART_MASK                    ((uint32_t)0x00000001U)         /* !< Master FRMSTART interrupt flag */
#define LCD_MIS_FRMSTART_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt flag cleared */
#define LCD_MIS_FRMSTART_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt flag set */
/* LCD_MIS[BLKOFF] Bits */
#define LCD_MIS_BLKOFF_OFS                       (1)                             /* !< BLKOFF Offset */
#define LCD_MIS_BLKOFF_MASK                      ((uint32_t)0x00000002U)         /* !< Masked BLKOFF interrupt flag */
#define LCD_MIS_BLKOFF_CLR                       ((uint32_t)0x00000000U)         /* !< Masked interrupt flag cleared */
#define LCD_MIS_BLKOFF_SET                       ((uint32_t)0x00000002U)         /* !< Masked interrupt flag set */
/* LCD_MIS[BLKON] Bits */
#define LCD_MIS_BLKON_OFS                        (2)                             /* !< BLKON Offset */
#define LCD_MIS_BLKON_MASK                       ((uint32_t)0x00000004U)         /* !< Masked BLKON interrupt flag */
#define LCD_MIS_BLKON_CLR                        ((uint32_t)0x00000000U)         /* !< Masked interrupt flag cleared */
#define LCD_MIS_BLKON_SET                        ((uint32_t)0x00000004U)         /* !< Masked interrupt flag set */

/* LCD_ISET Bits */
/* LCD_ISET[FRMSTART] Bits */
#define LCD_ISET_FRMSTART_OFS                    (0)                             /* !< FRMSTART Offset */
#define LCD_ISET_FRMSTART_MASK                   ((uint32_t)0x00000001U)         /* !< Set FRMSTART RIS flag. */
#define LCD_ISET_FRMSTART_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ISET_FRMSTART_SET                    ((uint32_t)0x00000001U)         /* !< Set corresponding RIS flag */
/* LCD_ISET[BLKOFF] Bits */
#define LCD_ISET_BLKOFF_OFS                      (1)                             /* !< BLKOFF Offset */
#define LCD_ISET_BLKOFF_MASK                     ((uint32_t)0x00000002U)         /* !< Set BLKOFF RIS flag */
#define LCD_ISET_BLKOFF_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ISET_BLKOFF_SET                      ((uint32_t)0x00000002U)         /* !< Set corresponding RIS flag */
/* LCD_ISET[BLKON] Bits */
#define LCD_ISET_BLKON_OFS                       (2)                             /* !< BLKON Offset */
#define LCD_ISET_BLKON_MASK                      ((uint32_t)0x00000004U)         /* !< Set BLKON RIS flag */
#define LCD_ISET_BLKON_NO_EFFECT                 ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ISET_BLKON_SET                       ((uint32_t)0x00000004U)         /* !< Set corresponding RIS flag */

/* LCD_ICLR Bits */
/* LCD_ICLR[FRMSTART] Bits */
#define LCD_ICLR_FRMSTART_OFS                    (0)                             /* !< FRMSTART Offset */
#define LCD_ICLR_FRMSTART_MASK                   ((uint32_t)0x00000001U)         /* !< Clear FRMSTART RIS flag */
#define LCD_ICLR_FRMSTART_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ICLR_FRMSTART_CLR                    ((uint32_t)0x00000001U)         /* !< Clear corresponding RIS flag */
/* LCD_ICLR[BLKOFF] Bits */
#define LCD_ICLR_BLKOFF_OFS                      (1)                             /* !< BLKOFF Offset */
#define LCD_ICLR_BLKOFF_MASK                     ((uint32_t)0x00000002U)         /* !< Clear BLKOFF RIS flag */
#define LCD_ICLR_BLKOFF_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ICLR_BLKOFF_CLR                      ((uint32_t)0x00000002U)         /* !< Clear corresponding RIS flag */
/* LCD_ICLR[BLKON] Bits */
#define LCD_ICLR_BLKON_OFS                       (2)                             /* !< BLKON Offset */
#define LCD_ICLR_BLKON_MASK                      ((uint32_t)0x00000004U)         /* !< Clear BLKON RIS flag */
#define LCD_ICLR_BLKON_NO_EFFECT                 ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_ICLR_BLKON_CLR                       ((uint32_t)0x00000004U)         /* !< Clear corresponding RIS flag */

/* LCD_PWREN Bits */
/* LCD_PWREN[ENABLE] Bits */
#define LCD_PWREN_ENABLE_OFS                     (0)                             /* !< ENABLE Offset */
#define LCD_PWREN_ENABLE_MASK                    ((uint32_t)0x00000001U)         /* !< Enable the power */
#define LCD_PWREN_ENABLE_DISABLE                 ((uint32_t)0x00000000U)         /* !< Disable Power */
#define LCD_PWREN_ENABLE_ENABLE                  ((uint32_t)0x00000001U)         /* !< Enable Power */
/* LCD_PWREN[KEY] Bits */
#define LCD_PWREN_KEY_OFS                        (24)                            /* !< KEY Offset */
#define LCD_PWREN_KEY_MASK                       ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define LCD_PWREN_KEY_UNLOCK_W                   ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* LCD_RSTCTL Bits */
/* LCD_RSTCTL[RESETSTKYCLR] Bits */
#define LCD_RSTCTL_RESETSTKYCLR_OFS              (1)                             /* !< RESETSTKYCLR Offset */
#define LCD_RSTCTL_RESETSTKYCLR_MASK             ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define LCD_RSTCTL_RESETSTKYCLR_NOP              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_RSTCTL_RESETSTKYCLR_CLR              ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* LCD_RSTCTL[RESETASSERT] Bits */
#define LCD_RSTCTL_RESETASSERT_OFS               (0)                             /* !< RESETASSERT Offset */
#define LCD_RSTCTL_RESETASSERT_MASK              ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define LCD_RSTCTL_RESETASSERT_NOP               ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define LCD_RSTCTL_RESETASSERT_ASSERT            ((uint32_t)0x00000001U)         /* !< Assert reset */
/* LCD_RSTCTL[KEY] Bits */
#define LCD_RSTCTL_KEY_OFS                       (24)                            /* !< KEY Offset */
#define LCD_RSTCTL_KEY_MASK                      ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define LCD_RSTCTL_KEY_UNLOCK_W                  ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* LCD_STAT Bits */
/* LCD_STAT[RESETSTKY] Bits */
#define LCD_STAT_RESETSTKY_OFS                   (16)                            /* !< RESETSTKY Offset */
#define LCD_STAT_RESETSTKY_MASK                  ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define LCD_STAT_RESETSTKY_NORES                 ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define LCD_STAT_RESETSTKY_RESET                 ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */

/* LCD_EVT_MODE Bits */
/* LCD_EVT_MODE[INT0_CFG] Bits */
#define LCD_EVT_MODE_INT0_CFG_OFS                (0)                             /* !< INT0_CFG Offset */
#define LCD_EVT_MODE_INT0_CFG_MASK               ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to
                                                                                    [IPSTANDARD.INT_EVENT0] */
#define LCD_EVT_MODE_INT0_CFG_DISABLE            ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define LCD_EVT_MODE_INT0_CFG_SOFTWARE           ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define LCD_EVT_MODE_INT0_CFG_HARDWARE           ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

