sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDCTL0 Bits */
/* LCD_LCDCTL0[LCDDIVX] Bits */
#define LCD_LCDCTL0_LCDDIVX_OFS                  (11)                            /* !< LCDDIVX Offset */
#define LCD_LCDCTL0_LCDDIVX_MASK                 ((uint32_t)0x0000F800U)         /* !< LCD frequency divider. Together
                                                                                    with LCDMXx, the LCD frequency fLCD
                                                                                    is calculated as fLCD = fSOURCE /
                                                                                    ((LCDDIVx + 1) * Value[LCDMXx]).
                                                                                    Change only while LCDON = 0.  00000b
                                                                                    = Divide by 1 00001b = Divide by 2 .
                                                                                    11110b = Divide by 31 11111b = Divide
                                                                                    by 32 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_1             ((uint32_t)0x00000000U)         /* !< Divide by 1 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_2             ((uint32_t)0x00000800U)         /* !< Divide by 2 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_3             ((uint32_t)0x00001000U)         /* !< Divide by 3 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_4             ((uint32_t)0x00001800U)         /* !< Divide by 4 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_5             ((uint32_t)0x00002000U)         /* !< Divide by 5 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_6             ((uint32_t)0x00002800U)         /* !< Divide by 6 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_7             ((uint32_t)0x00003000U)         /* !< Divide by 7 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_8             ((uint32_t)0x00003800U)         /* !< Divide by 8 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_9             ((uint32_t)0x00004000U)         /* !< Divide by 9 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_10            ((uint32_t)0x00004800U)         /* !< Divide by 10 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_11            ((uint32_t)0x00005000U)         /* !< Divide by 11 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_12            ((uint32_t)0x00005800U)         /* !< Divide by 12 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_13            ((uint32_t)0x00006000U)         /* !< Divide by 13 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_14            ((uint32_t)0x00006800U)         /* !< Divide by 14 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_15            ((uint32_t)0x00007000U)         /* !< Divide by 15 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_16            ((uint32_t)0x00007800U)         /* !< Divide by 16 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_17            ((uint32_t)0x00008000U)         /* !< Divide by 17 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_18            ((uint32_t)0x00008800U)         /* !< Divide by 18 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_19            ((uint32_t)0x00009000U)         /* !< Divide by 19 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_20            ((uint32_t)0x00009800U)         /* !< Divide by 20 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_21            ((uint32_t)0x0000A000U)         /* !< Divide by 21 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_22            ((uint32_t)0x0000A800U)         /* !< Divide by 22 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_23            ((uint32_t)0x0000B000U)         /* !< Divide by 23 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_24            ((uint32_t)0x0000B800U)         /* !< Divide by 24 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_25            ((uint32_t)0x0000C000U)         /* !< Divide by 25 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_26            ((uint32_t)0x0000C800U)         /* !< Divide by 26 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_27            ((uint32_t)0x0000D000U)         /* !< Divide by 27 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_28            ((uint32_t)0x0000D800U)         /* !< Divide by 28 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_29            ((uint32_t)0x0000E000U)         /* !< Divide by 29 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_30            ((uint32_t)0x0000E800U)         /* !< Divide by 30 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_31            ((uint32_t)0x0000F000U)         /* !< Divide by 31 */
#define LCD_LCDCTL0_LCDDIVX_DIV_BY_32            ((uint32_t)0x0000F800U)         /* !< Divide by 32 */
/* LCD_LCDCTL0[LCDLP] Bits */
#define LCD_LCDCTL0_LCDLP_OFS                    (1)                             /* !< LCDLP Offset */
#define LCD_LCDCTL0_LCDLP_MASK                   ((uint32_t)0x00000002U)         /* !< LCD low-power waveform. This bit is
                                                                                    only applicable for 1/3 bias mode,
                                                                                    that is, for LCDBIASSEL = 0.  0b =
                                                                                    Standard LCD waveforms on segment and
                                                                                    common lines selected.  1b =
                                                                                    Low-power LCD waveforms on segment
                                                                                    and common lines selected. */
#define LCD_LCDCTL0_LCDLP_STD_LCD                ((uint32_t)0x00000000U)         /* !< Standard LCD waveforms */
#define LCD_LCDCTL0_LCDLP_LP_LCD                 ((uint32_t)0x00000002U)         /* !< Low power LCD waveforms */
/* LCD_LCDCTL0[LCDMXX] Bits */
#define LCD_LCDCTL0_LCDMXX_OFS                   (3)                             /* !< LCDMXX Offset */
#define LCD_LCDCTL0_LCDMXX_MASK                  ((uint32_t)0x00000038U)         /* !< LCD mux rate. These bits select the
                                                                                    LCD mode. Change only while LCDON =
                                                                                    0.  000b = Static 001b = 2-mux 010b =
                                                                                    3-mux 011b = 4-mux 100b = 5-mux 101b
                                                                                    = 6-mux 110b = 7-mux 111b = 8-mux */
#define LCD_LCDCTL0_LCDMXX_MX_STATIC             ((uint32_t)0x00000000U)         /* !< Static */
#define LCD_LCDCTL0_LCDMXX_MX_2                  ((uint32_t)0x00000008U)         /* !< 2-mux */
#define LCD_LCDCTL0_LCDMXX_MX_3                  ((uint32_t)0x00000010U)         /* !< 3-mux */
#define LCD_LCDCTL0_LCDMXX_MX_4                  ((uint32_t)0x00000018U)         /* !< 4-mux */
#define LCD_LCDCTL0_LCDMXX_MX_5                  ((uint32_t)0x00000020U)         /* !< 5-mux */
#define LCD_LCDCTL0_LCDMXX_MX_6                  ((uint32_t)0x00000028U)         /* !< 6-mux */
#define LCD_LCDCTL0_LCDMXX_MX_7                  ((uint32_t)0x00000030U)         /* !< 7-mux */
#define LCD_LCDCTL0_LCDMXX_MX_8                  ((uint32_t)0x00000038U)         /* !< 8-mux */
/* LCD_LCDCTL0[LCDON] Bits */
#define LCD_LCDCTL0_LCDON_OFS                    (0)                             /* !< LCDON Offset */
#define LCD_LCDCTL0_LCDON_MASK                   ((uint32_t)0x00000001U)         /* !< LCD on. This bit turns the LCD
                                                                                    module on or off.  0b = LCD module
                                                                                    off 1b = LCD module on */
#define LCD_LCDCTL0_LCDON_LCD_MOD_DISABLE        ((uint32_t)0x00000000U)         /* !< LCD module off */
#define LCD_LCDCTL0_LCDON_LCD_MOD_ENABLE         ((uint32_t)0x00000001U)         /* !< LCD module on */
/* LCD_LCDCTL0[LCDSON] Bits */
#define LCD_LCDCTL0_LCDSON_OFS                   (2)                             /* !< LCDSON Offset */
#define LCD_LCDCTL0_LCDSON_MASK                  ((uint32_t)0x00000004U)         /* !< LCD segments on. This bit supports
                                                                                    flashing LCD applications by turning
                                                                                    off all segment lines, while leaving
                                                                                    the LCD timing generator and R33
                                                                                    enabled.  0b = All LCD segments are
                                                                                    off.  1b = All LCD segments are
                                                                                    enabled and on or off according to
                                                                                    their corresponding memory location. */
#define LCD_LCDCTL0_LCDSON_LCD_SEG_OFF           ((uint32_t)0x00000000U)         /* !< All LCD segments are off. */
#define LCD_LCDCTL0_LCDSON_LCD_SEG_ON            ((uint32_t)0x00000004U)         /* !< All LCD segments are enabled and on
                                                                                    or off according to their
                                                                                    corresponding memory location. */
/* LCD_LCDCTL0[LCDSYNCEXT] Bits */
#define LCD_LCDCTL0_LCDSYNCEXT_OFS               (24)                            /* !< LCDSYNCEXT Offset */
#define LCD_LCDCTL0_LCDSYNCEXT_MASK              ((uint32_t)0x01000000U)
#define LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_OFF  ((uint32_t)0x00000000U)         /* !< External eynchronization off. */
#define LCD_LCDCTL0_LCDSYNCEXT_LCD_EXT_SYNC_ON   ((uint32_t)0x01000000U)         /* !< External synchronization on. */

/* LCD_LCDBLKCTL Bits */
/* LCD_LCDBLKCTL[LCDBLKMODX] Bits */
#define LCD_LCDBLKCTL_LCDBLKMODX_OFS             (0)                             /* !< LCDBLKMODX Offset */
#define LCD_LCDBLKCTL_LCDBLKMODX_MASK            ((uint32_t)0x00000003U)         /* !< Blinking mode 00b = Blinking
                                                                                    disabled.  01b = Blinking of
                                                                                    individual segments as enabled in
                                                                                    blinking memory register LCDBMx. In
                                                                                    mux mode >5 blinking is disabled.
                                                                                    10b = Blinking of all segments 11b =
                                                                                    Switching between display contents as
                                                                                    stored in LCDMx and LCDBMx memory
                                                                                    registers. In mux mode >5 blinking is
                                                                                    disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_DISABLE   ((uint32_t)0x00000000U)         /* !< Blinking disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_SELECED   ((uint32_t)0x00000001U)         /* !< Blinking of individual segments as
                                                                                    enabled in blinking memory register
                                                                                    LCDBMx. In mux mode >5 blinking is
                                                                                    disabled. */
#define LCD_LCDBLKCTL_LCDBLKMODX_BLINK_ALL       ((uint32_t)0x00000002U)         /* !< Blinking of all segments */
#define LCD_LCDBLKCTL_LCDBLKMODX_BKINK_TOGGLE    ((uint32_t)0x00000003U)         /* !< Switching between display contents
                                                                                    as stored in LCDMx and LCDBMx memory
                                                                                    registers. In mux mode >5 blinking is
                                                                                    disabled. */
/* LCD_LCDBLKCTL[LCDBLKPREX] Bits */
#define LCD_LCDBLKCTL_LCDBLKPREX_OFS             (2)                             /* !< LCDBLKPREX Offset */
#define LCD_LCDBLKCTL_LCDBLKPREX_MASK            ((uint32_t)0x0000001CU)         /* !< Clock prescaler for blinking
                                                                                    frequency. */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_2        ((uint32_t)0x00000000U)         /* !< Divide by 2 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_4        ((uint32_t)0x00000004U)         /* !< Divide by 4 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_8        ((uint32_t)0x00000008U)         /* !< Divide by 8 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_16       ((uint32_t)0x0000000CU)         /* !< Divide by 16 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_32       ((uint32_t)0x00000010U)         /* !< Divide by 32 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_64       ((uint32_t)0x00000014U)         /* !< Divide by 64 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_128      ((uint32_t)0x00000018U)         /* !< Divide by 128 */
#define LCD_LCDBLKCTL_LCDBLKPREX_DIV_BY_256      ((uint32_t)0x0000001CU)         /* !< Divide by 256 */

/* LCD_LCDMEMCTL Bits */
/* LCD_LCDMEMCTL[LCDCLRBM] Bits */
#define LCD_LCDMEMCTL_LCDCLRBM_OFS               (2)                             /* !< LCDCLRBM Offset */
#define LCD_LCDMEMCTL_LCDCLRBM_MASK              ((uint32_t)0x00000004U)         /* !< Clear LCD blinking memory Clears
                                                                                    all blinking memory registers LCDBMx.
                                                                                    The bit is automatically reset when
                                                                                    the blinking memory is cleared.
                                                                                    Setting this bit in 5-mux mode and
                                                                                    above has no effect. It is
                                                                                    immediately reset again.  0b =
                                                                                    Contents of blinking memory registers
                                                                                    LCDBMx remain unchanged 1b = Clear
                                                                                    content of all blinking memory
                                                                                    registers LCDBMx */
#define LCD_LCDMEMCTL_LCDCLRBM_NO_CLR_BLNK_MEM_REGS ((uint32_t)0x00000000U)         /* !< Contents of blinking memory
                                                                                    registers LCDBMx remain unchanged */
#define LCD_LCDMEMCTL_LCDCLRBM_CLR_BLNK_MEM_REGS ((uint32_t)0x00000004U)         /* !< Clear content of all blinking
                                                                                    memory registers LCDBMx */
/* LCD_LCDMEMCTL[LCDCLRM] Bits */
#define LCD_LCDMEMCTL_LCDCLRM_OFS                (1)                             /* !< LCDCLRM Offset */
#define LCD_LCDMEMCTL_LCDCLRM_MASK               ((uint32_t)0x00000002U)         /* !< Clear LCD memory Clears all LCD
                                                                                    memory registers LCDMx. The bit is
                                                                                    automatically reset when the LCD
                                                                                    memory is cleared.  0b = Contents of
                                                                                    LCD memory registers LCDMx remain
                                                                                    unchanged 1b = Clear content of all
                                                                                    LCD memory registers LCDMx */
#define LCD_LCDMEMCTL_LCDCLRM_NO_CLR_LCD_MEM_REGS ((uint32_t)0x00000000U)         /* !< Contents of LCD memory registers
                                                                                    LCDMx remain unchanged */
#define LCD_LCDMEMCTL_LCDCLRM_CLR_LCD_MEM_REGS   ((uint32_t)0x00000002U)         /* !< Clear content of all LCD memory
                                                                                    registers LCDMx */
/* LCD_LCDMEMCTL[LCDDISP] Bits */
#define LCD_LCDMEMCTL_LCDDISP_OFS                (0)                             /* !< LCDDISP Offset */
#define LCD_LCDMEMCTL_LCDDISP_MASK               ((uint32_t)0x00000001U)         /* !< Select LCD memory registers for
                                                                                    display When LCDBLKMODx = 00, LCDDISP
                                                                                    can be set by software.  The bit is
                                                                                    cleared in LCDBLKMODx = 01 and
                                                                                    LCDBLKMODx = 10 or if a mux mode =5
                                                                                    is selected and cannot be changed by
                                                                                    software.  When LCDBLKMODx = 11, this
                                                                                    bit reflects the currently displayed
                                                                                    memory but cannot be changed by
                                                                                    software. When returning to
                                                                                    LCDBLKMODx = 00 the bit is cleared.
                                                                                    0b = Display content of LCD memory
                                                                                    registers LCDMx 1b = Display content
                                                                                    of LCD blinking memory registers
                                                                                    LCDBMx */
#define LCD_LCDMEMCTL_LCDDISP_SEL_LCD_MEM_REGS   ((uint32_t)0x00000000U)         /* !< Display content of LCD memory
                                                                                    registers LCDMx */
#define LCD_LCDMEMCTL_LCDDISP_SEL_BLNK_MEM_REGS  ((uint32_t)0x00000001U)         /* !< Display content of LCD blinking
                                                                                    memory registers LCDBMx */

