sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDPCTL1 Bits */
/* LCD_LCDPCTL1[LCDS16] Bits */
#define LCD_LCDPCTL1_LCDS16_OFS                  (0)                             /* !< LCDS16 Offset */
#define LCD_LCDPCTL1_LCDS16_MASK                 ((uint32_t)0x00000001U)         /* !< LCD segment line 16 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS16_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS16_SEL_LCD              ((uint32_t)0x00000001U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS17] Bits */
#define LCD_LCDPCTL1_LCDS17_OFS                  (1)                             /* !< LCDS17 Offset */
#define LCD_LCDPCTL1_LCDS17_MASK                 ((uint32_t)0x00000002U)         /* !< LCD segment line 17 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS17_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS17_SEL_LCD              ((uint32_t)0x00000002U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS18] Bits */
#define LCD_LCDPCTL1_LCDS18_OFS                  (2)                             /* !< LCDS18 Offset */
#define LCD_LCDPCTL1_LCDS18_MASK                 ((uint32_t)0x00000004U)         /* !< LCD segment line 18 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS18_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS18_SEL_LCD              ((uint32_t)0x00000004U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS19] Bits */
#define LCD_LCDPCTL1_LCDS19_OFS                  (3)                             /* !< LCDS19 Offset */
#define LCD_LCDPCTL1_LCDS19_MASK                 ((uint32_t)0x00000008U)         /* !< LCD segment line 19 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS19_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS19_SEL_LCD              ((uint32_t)0x00000008U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS20] Bits */
#define LCD_LCDPCTL1_LCDS20_OFS                  (4)                             /* !< LCDS20 Offset */
#define LCD_LCDPCTL1_LCDS20_MASK                 ((uint32_t)0x00000010U)         /* !< LCD segment line 20 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS20_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS20_SEL_LCD              ((uint32_t)0x00000010U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS21] Bits */
#define LCD_LCDPCTL1_LCDS21_OFS                  (5)                             /* !< LCDS21 Offset */
#define LCD_LCDPCTL1_LCDS21_MASK                 ((uint32_t)0x00000020U)         /* !< LCD segment line 21 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS21_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS21_SEL_LCD              ((uint32_t)0x00000020U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS22] Bits */
#define LCD_LCDPCTL1_LCDS22_OFS                  (6)                             /* !< LCDS22 Offset */
#define LCD_LCDPCTL1_LCDS22_MASK                 ((uint32_t)0x00000040U)         /* !< LCD segment line 22 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS22_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS22_SEL_LCD              ((uint32_t)0x00000040U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS23] Bits */
#define LCD_LCDPCTL1_LCDS23_OFS                  (7)                             /* !< LCDS23 Offset */
#define LCD_LCDPCTL1_LCDS23_MASK                 ((uint32_t)0x00000080U)         /* !< LCD segment line 23 enable. This
                                                                                    bit affects only pins with
                                                                                    multiplexed functions.  Dedicated LCD
                                                                                    pins are always LCD function.  0b =
                                                                                    Multiplexed pins are port functions.
                                                                                    1b = Pins are LCD functions. */
#define LCD_LCDPCTL1_LCDS23_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS23_SEL_LCD              ((uint32_t)0x00000080U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS24] Bits */
#define LCD_LCDPCTL1_LCDS24_OFS                  (8)                             /* !< LCDS24 Offset */
#define LCD_LCDPCTL1_LCDS24_MASK                 ((uint32_t)0x00000100U)         /* !< LCD pin 24 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS24_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS24_SEL_LCD              ((uint32_t)0x00000100U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS25] Bits */
#define LCD_LCDPCTL1_LCDS25_OFS                  (9)                             /* !< LCDS25 Offset */
#define LCD_LCDPCTL1_LCDS25_MASK                 ((uint32_t)0x00000200U)         /* !< LCD pin 25 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS25_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS25_SEL_LCD              ((uint32_t)0x00000200U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS26] Bits */
#define LCD_LCDPCTL1_LCDS26_OFS                  (10)                            /* !< LCDS26 Offset */
#define LCD_LCDPCTL1_LCDS26_MASK                 ((uint32_t)0x00000400U)         /* !< LCD pin 26 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS26_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS26_SEL_LCD              ((uint32_t)0x00000400U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS27] Bits */
#define LCD_LCDPCTL1_LCDS27_OFS                  (11)                            /* !< LCDS27 Offset */
#define LCD_LCDPCTL1_LCDS27_MASK                 ((uint32_t)0x00000800U)         /* !< LCD pin 27 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS27_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS27_SEL_LCD              ((uint32_t)0x00000800U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS28] Bits */
#define LCD_LCDPCTL1_LCDS28_OFS                  (12)                            /* !< LCDS28 Offset */
#define LCD_LCDPCTL1_LCDS28_MASK                 ((uint32_t)0x00001000U)         /* !< LCD pin 28 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS28_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS28_SEL_LCD              ((uint32_t)0x00001000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS29] Bits */
#define LCD_LCDPCTL1_LCDS29_OFS                  (13)                            /* !< LCDS29 Offset */
#define LCD_LCDPCTL1_LCDS29_MASK                 ((uint32_t)0x00002000U)         /* !< LCD pin 29 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS29_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS29_SEL_LCD              ((uint32_t)0x00002000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS30] Bits */
#define LCD_LCDPCTL1_LCDS30_OFS                  (14)                            /* !< LCDS30 Offset */
#define LCD_LCDPCTL1_LCDS30_MASK                 ((uint32_t)0x00004000U)         /* !< LCD pin 30 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS30_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS30_SEL_LCD              ((uint32_t)0x00004000U)         /* !< Pins are LCD functions. */
/* LCD_LCDPCTL1[LCDS31] Bits */
#define LCD_LCDPCTL1_LCDS31_OFS                  (15)                            /* !< LCDS31 Offset */
#define LCD_LCDPCTL1_LCDS31_MASK                 ((uint32_t)0x00008000U)         /* !< LCD pin 31 enable. This bit affects
                                                                                    only pins with multiplexed functions.
                                                                                    Dedicated LCD pins are always LCD
                                                                                    function.  0b = Multiplexed pins are
                                                                                    port functions.  1b = Pins are LCD
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS31_SEL_PORT             ((uint32_t)0x00000000U)         /* !< Multiplexed pins are port
                                                                                    functions. */
#define LCD_LCDPCTL1_LCDS31_SEL_LCD              ((uint32_t)0x00008000U)         /* !< Pins are LCD functions. */

