sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_lcd.h
/* LCD_LCDCSSEL0 Bits */
/* LCD_LCDCSSEL0[LCDCSS0] Bits */
#define LCD_LCDCSSEL0_LCDCSS0_OFS                (0)                             /* !< LCDCSS0 Offset */
#define LCD_LCDCSSEL0_LCDCSS0_MASK               ((uint32_t)0x00000001U)         /* !< Selects pin L0 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS0_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS0_SEL_COM            ((uint32_t)0x00000001U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS1] Bits */
#define LCD_LCDCSSEL0_LCDCSS1_OFS                (1)                             /* !< LCDCSS1 Offset */
#define LCD_LCDCSSEL0_LCDCSS1_MASK               ((uint32_t)0x00000002U)         /* !< Selects pin L1 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS1_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS1_SEL_COM            ((uint32_t)0x00000002U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS10] Bits */
#define LCD_LCDCSSEL0_LCDCSS10_OFS               (10)                            /* !< LCDCSS10 Offset */
#define LCD_LCDCSSEL0_LCDCSS10_MASK              ((uint32_t)0x00000400U)         /* !< Selects pin L10 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS10_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS10_SEL_COM           ((uint32_t)0x00000400U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS11] Bits */
#define LCD_LCDCSSEL0_LCDCSS11_OFS               (11)                            /* !< LCDCSS11 Offset */
#define LCD_LCDCSSEL0_LCDCSS11_MASK              ((uint32_t)0x00000800U)         /* !< Selects pin L11 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS11_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS11_SEL_COM           ((uint32_t)0x00000800U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS12] Bits */
#define LCD_LCDCSSEL0_LCDCSS12_OFS               (12)                            /* !< LCDCSS12 Offset */
#define LCD_LCDCSSEL0_LCDCSS12_MASK              ((uint32_t)0x00001000U)         /* !< Selects pin L12 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS12_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS12_SEL_COM           ((uint32_t)0x00001000U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS13] Bits */
#define LCD_LCDCSSEL0_LCDCSS13_OFS               (13)                            /* !< LCDCSS13 Offset */
#define LCD_LCDCSSEL0_LCDCSS13_MASK              ((uint32_t)0x00002000U)         /* !< Selects pin L13 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS13_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS13_SEL_COM           ((uint32_t)0x00002000U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS14] Bits */
#define LCD_LCDCSSEL0_LCDCSS14_OFS               (14)                            /* !< LCDCSS14 Offset */
#define LCD_LCDCSSEL0_LCDCSS14_MASK              ((uint32_t)0x00004000U)         /* !< Selects pin L14 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS14_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS14_SEL_COM           ((uint32_t)0x00004000U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS15] Bits */
#define LCD_LCDCSSEL0_LCDCSS15_OFS               (15)                            /* !< LCDCSS15 Offset */
#define LCD_LCDCSSEL0_LCDCSS15_MASK              ((uint32_t)0x00008000U)         /* !< Selects pin L15 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS15_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS15_SEL_COM           ((uint32_t)0x00008000U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS2] Bits */
#define LCD_LCDCSSEL0_LCDCSS2_OFS                (2)                             /* !< LCDCSS2 Offset */
#define LCD_LCDCSSEL0_LCDCSS2_MASK               ((uint32_t)0x00000004U)         /* !< Selects pin L2 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS2_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS2_SEL_COM            ((uint32_t)0x00000004U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS3] Bits */
#define LCD_LCDCSSEL0_LCDCSS3_OFS                (3)                             /* !< LCDCSS3 Offset */
#define LCD_LCDCSSEL0_LCDCSS3_MASK               ((uint32_t)0x00000008U)         /* !< Selects pin L3 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS3_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS3_SEL_COM            ((uint32_t)0x00000008U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS4] Bits */
#define LCD_LCDCSSEL0_LCDCSS4_OFS                (4)                             /* !< LCDCSS4 Offset */
#define LCD_LCDCSSEL0_LCDCSS4_MASK               ((uint32_t)0x00000010U)         /* !< Selects pin L4 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS4_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS4_SEL_COM            ((uint32_t)0x00000010U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS5] Bits */
#define LCD_LCDCSSEL0_LCDCSS5_OFS                (5)                             /* !< LCDCSS5 Offset */
#define LCD_LCDCSSEL0_LCDCSS5_MASK               ((uint32_t)0x00000020U)         /* !< Selects pin L5 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS5_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS5_SEL_COM            ((uint32_t)0x00000020U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS6] Bits */
#define LCD_LCDCSSEL0_LCDCSS6_OFS                (6)                             /* !< LCDCSS6 Offset */
#define LCD_LCDCSSEL0_LCDCSS6_MASK               ((uint32_t)0x00000040U)         /* !< Selects pin L6 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS6_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS6_SEL_COM            ((uint32_t)0x00000040U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS7] Bits */
#define LCD_LCDCSSEL0_LCDCSS7_OFS                (7)                             /* !< LCDCSS7 Offset */
#define LCD_LCDCSSEL0_LCDCSS7_MASK               ((uint32_t)0x00000080U)         /* !< Selects pin L7 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS7_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS7_SEL_COM            ((uint32_t)0x00000080U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS8] Bits */
#define LCD_LCDCSSEL0_LCDCSS8_OFS                (8)                             /* !< LCDCSS8 Offset */
#define LCD_LCDCSSEL0_LCDCSS8_MASK               ((uint32_t)0x00000100U)         /* !< Selects pin L8 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS8_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS8_SEL_COM            ((uint32_t)0x00000100U)         /* !< Common line */
/* LCD_LCDCSSEL0[LCDCSS9] Bits */
#define LCD_LCDCSSEL0_LCDCSS9_OFS                (9)                             /* !< LCDCSS9 Offset */
#define LCD_LCDCSSEL0_LCDCSS9_MASK               ((uint32_t)0x00000200U)         /* !< Selects pin L9 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL0_LCDCSS9_SEL_SEG            ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL0_LCDCSS9_SEL_COM            ((uint32_t)0x00000200U)         /* !< Common line */

/* LCD_LCDCSSEL1 Bits */
/* LCD_LCDCSSEL1[LCDCSS16] Bits */
#define LCD_LCDCSSEL1_LCDCSS16_OFS               (0)                             /* !< LCDCSS16 Offset */
#define LCD_LCDCSSEL1_LCDCSS16_MASK              ((uint32_t)0x00000001U)         /* !< Selects pin L16 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS16_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS16_SEL_COM           ((uint32_t)0x00000001U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS17] Bits */
#define LCD_LCDCSSEL1_LCDCSS17_OFS               (1)                             /* !< LCDCSS17 Offset */
#define LCD_LCDCSSEL1_LCDCSS17_MASK              ((uint32_t)0x00000002U)         /* !< Selects pin L17 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS17_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS17_SEL_COM           ((uint32_t)0x00000002U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS18] Bits */
#define LCD_LCDCSSEL1_LCDCSS18_OFS               (2)                             /* !< LCDCSS18 Offset */
#define LCD_LCDCSSEL1_LCDCSS18_MASK              ((uint32_t)0x00000004U)         /* !< Selects pin L18 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS18_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS18_SEL_COM           ((uint32_t)0x00000004U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS19] Bits */
#define LCD_LCDCSSEL1_LCDCSS19_OFS               (3)                             /* !< LCDCSS19 Offset */
#define LCD_LCDCSSEL1_LCDCSS19_MASK              ((uint32_t)0x00000008U)         /* !< Selects pin L19 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS19_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS19_SEL_COM           ((uint32_t)0x00000008U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS20] Bits */
#define LCD_LCDCSSEL1_LCDCSS20_OFS               (4)                             /* !< LCDCSS20 Offset */
#define LCD_LCDCSSEL1_LCDCSS20_MASK              ((uint32_t)0x00000010U)         /* !< Selects pin L20 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS20_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS20_SEL_COM           ((uint32_t)0x00000010U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS21] Bits */
#define LCD_LCDCSSEL1_LCDCSS21_OFS               (5)                             /* !< LCDCSS21 Offset */
#define LCD_LCDCSSEL1_LCDCSS21_MASK              ((uint32_t)0x00000020U)         /* !< Selects pin L21 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS21_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS21_SEL_COM           ((uint32_t)0x00000020U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS22] Bits */
#define LCD_LCDCSSEL1_LCDCSS22_OFS               (6)                             /* !< LCDCSS22 Offset */
#define LCD_LCDCSSEL1_LCDCSS22_MASK              ((uint32_t)0x00000040U)         /* !< Selects pin L22 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS22_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS22_SEL_COM           ((uint32_t)0x00000040U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS23] Bits */
#define LCD_LCDCSSEL1_LCDCSS23_OFS               (7)                             /* !< LCDCSS23 Offset */
#define LCD_LCDCSSEL1_LCDCSS23_MASK              ((uint32_t)0x00000080U)         /* !< Selects pin L23 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS23_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS23_SEL_COM           ((uint32_t)0x00000080U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS24] Bits */
#define LCD_LCDCSSEL1_LCDCSS24_OFS               (8)                             /* !< LCDCSS24 Offset */
#define LCD_LCDCSSEL1_LCDCSS24_MASK              ((uint32_t)0x00000100U)         /* !< Selects pin L24 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS24_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS24_SEL_COM           ((uint32_t)0x00000100U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS25] Bits */
#define LCD_LCDCSSEL1_LCDCSS25_OFS               (9)                             /* !< LCDCSS25 Offset */
#define LCD_LCDCSSEL1_LCDCSS25_MASK              ((uint32_t)0x00000200U)         /* !< Selects pin L25 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS25_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS25_SEL_COM           ((uint32_t)0x00000200U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS26] Bits */
#define LCD_LCDCSSEL1_LCDCSS26_OFS               (10)                            /* !< LCDCSS26 Offset */
#define LCD_LCDCSSEL1_LCDCSS26_MASK              ((uint32_t)0x00000400U)         /* !< Selects pin L26 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS26_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS26_SEL_COM           ((uint32_t)0x00000400U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS27] Bits */
#define LCD_LCDCSSEL1_LCDCSS27_OFS               (11)                            /* !< LCDCSS27 Offset */
#define LCD_LCDCSSEL1_LCDCSS27_MASK              ((uint32_t)0x00000800U)         /* !< Selects pin L27 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS27_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS27_SEL_COM           ((uint32_t)0x00000800U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS28] Bits */
#define LCD_LCDCSSEL1_LCDCSS28_OFS               (12)                            /* !< LCDCSS28 Offset */
#define LCD_LCDCSSEL1_LCDCSS28_MASK              ((uint32_t)0x00001000U)         /* !< Selects pin L28 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS28_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS28_SEL_COM           ((uint32_t)0x00001000U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS29] Bits */
#define LCD_LCDCSSEL1_LCDCSS29_OFS               (13)                            /* !< LCDCSS29 Offset */
#define LCD_LCDCSSEL1_LCDCSS29_MASK              ((uint32_t)0x00002000U)         /* !< Selects pin L29 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS29_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS29_SEL_COM           ((uint32_t)0x00002000U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS30] Bits */
#define LCD_LCDCSSEL1_LCDCSS30_OFS               (14)                            /* !< LCDCSS30 Offset */
#define LCD_LCDCSSEL1_LCDCSS30_MASK              ((uint32_t)0x00004000U)         /* !< Selects pin L30 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS30_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS30_SEL_COM           ((uint32_t)0x00004000U)         /* !< Common line */
/* LCD_LCDCSSEL1[LCDCSS31] Bits */
#define LCD_LCDCSSEL1_LCDCSS31_OFS               (15)                            /* !< LCDCSS31 Offset */
#define LCD_LCDCSSEL1_LCDCSS31_MASK              ((uint32_t)0x00008000U)         /* !< Selects pin L31 as either common or
                                                                                    segment line.  0b = Segment line 1b =
                                                                                    Common line */
#define LCD_LCDCSSEL1_LCDCSS31_SEL_SEG           ((uint32_t)0x00000000U)         /* !< Segment line */
#define LCD_LCDCSSEL1_LCDCSS31_SEL_COM           ((uint32_t)0x00008000U)         /* !< Common line */

